Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: If a test fixture class is shared by normal tests and death tests, you can use using or typedef to introduce an alias for the fixture class and avoid duplicating its code:
it_it: Se una classe fixture è condivisa tra test normali e death test, si può utilizzare using o typedef per introdurre un alias per la classe fixture ed evitare di duplicarne il codice:

source: If a test fixture class is shared by normal tests and death tests, you can use `using` or `typedef` to introduce an alias for the fixture class and avoid duplicating its code:
it_it: Se una classe fixture è condivisa tra test normali e death test, si può utilizzare `using` o `typedef` per introdurre un alias per la classe fixture ed evitare di duplicarne il codice:

source: If a test program supports sharding, it will create this file to acknowledge that fact; otherwise it will not create it.
it_it: Se un programma di test supporta lo sharding, creerà questo file per riconoscere questo fatto; altrimenti non lo creerà.

source: If a test sub-routine is called from several places, when an assertion inside it fails, it can be hard to tell which invocation of the sub-routine the failure is from.
it_it: Se una sub-routine di test viene chiamata da più posti, quando un'asserzione al suo interno fallisce, può essere difficile dire da quale invocazione della sub-routine provenga il fallimento.

source: If a warning "File too large." is logged after this, it will be an error.
it_it: Se successivamente viene loggato un warning "File too large.", si tratterà di un errore.

source: If a warning `"File too large."` is logged after this, it will be an error.
it_it: Se successivamente viene loggato un warning `"File too large."`, si tratterà di un errore.

source: If a wide string (wchar_t*, TCHAR* in UNICODE mode on Windows, or std::wstring) is streamed to an assertion, it will be translated to UTF-8 when printed.
it_it: Se una stringa estesa [wide] (wchar_t*, TCHAR* in modalità UNICODE su Windows, o std::wstring) viene inviata ad un'asserzione, verrà tradotta in UTF-8 per la stampa.

source: If a wide string (`wchar_t*`, `TCHAR*` in `UNICODE` mode on Windows, or `std::wstring`) is streamed to an assertion, it will be translated to UTF-8 when printed.
it_it: Se una stringa wide (`wchar_t*`, `TCHAR*` in modalità `UNICODE` su Windows, o `std::wstring`) viene inviata in streaming a un'asserzione, verrà tradotto in UTF-8 una volta stampato.

source: If all this seems too abstract for you, don't worry - the most important thing to remember is that a mock allows you to check the interaction between itself and code that uses it.
it_it: Se tutto questo appare troppo astratto, non c'è da preoccuparsi: la cosa più importante da ricordare è che un mock consente di verificare l'interazione tra se stesso e il codice che lo utilizza.

source: If all this seems too abstract for you, don't worry - the most important thing to remember is that a mock allows you to check the *interaction* between itself and code that uses it.
it_it: Se tutto questo appare troppo astratto, non c'è da preoccuparsi: la cosa più importante da ricordare è che un mock consente di verificare l'*interazione* tra se stesso e il codice che lo utilizza.

source: If all you need to do is to change an output argument, the built-in SetArgPointee() action is convenient:
it_it: Se tutto ciò che si deve fare è modificare un argomento di output, conviene la "action" nativa SetArgPointee():

source: If all you need to do is to change an output argument, the built-in `SetArgPointee()` action is convenient:
it_it: Se tutto ciò che si deve fare è modificare un argomento di output, conviene la "action" nativa `SetArgPointee()`:

source: If an action can be used in several types of mock functions, we say it's polymorphic.
it_it: Se un'azione può essere utilizzata in diversi tipi di funzioni mock, diciamo che è polimorfica.

source: If an action can be used in several types of mock functions, we say it's *polymorphic*.
it_it: Se un'azione può essere utilizzata in diversi tipi di funzioni mock, diciamo che è *polimorfica*.

source: If an argument supports the << operator, it will be called to print the argument when the assertion fails.
it_it: Se un argomento supporta l'operatore <<, verrà chiamato per stampare l'argomento quando l'asserzione fallisce.

source: If an argument supports the `<<` operator, it will be called to print the argument when the assertion fails.
it_it: Se un argomento supporta l'operatore `<<`, verrà chiamato per stampare l'argomento quando l'asserzione fallisce.

source: If an option is specified both by an environment variable and by a flag, the latter takes precedence.
it_it: Se un'opzione è specificata sia da una variabile d'ambiente che da un flag, quest'ultimo ha la precedenza.

source: If another failure is detected, gMock will do the same, including printing the state of relevant expectations.
it_it: Se viene rilevato un altro errore, gMock farà lo stesso, inclusa la stampa dello stato delle expectation rilevanti.

source: If any WillOnce clauses have been specified, matching function calls will perform those actions before the action specified by WillRepeatedly.
it_it: Se sono state specificate clausole WillOnce, le chiamate di funzione corrispondenti [match] eseguiranno tali actions prima di quella specificata da WillRepeatedly.

source: If any `WillOnce` clauses have been specified, matching function calls will perform those actions before the action specified by `WillRepeatedly`.
it_it: Se sono state specificate clausole `WillOnce`, le chiamate di funzione corrispondenti [match] eseguiranno tali actions prima di quella specificata da `WillRepeatedly`.

source: If changing the function's type is not an option, you should just use assertions that generate non-fatal failures, such as ADD_FAILURE* and EXPECT_*.
it_it: Se non è possibile cambiare il tipo della funzione, si devono semplicemente usare asserzioni che generano errori non fatali, come ADD_FAILURE* e EXPECT_*.

source: If changing the function's type is not an option, you should just use assertions that generate non-fatal failures, such as `ADD_FAILURE*` and `EXPECT_*`.
it_it: Se non è possibile cambiare il tipo della funzione, si devono semplicemente usare asserzioni che generano errori non fatali, come `ADD_FAILURE*` e `EXPECT_*`.

source: If death tests are supported, behaves the same as EXPECT_DEATH.
it_it: Se i death test sono supportati, si comporta allo stesso modo di EXPECT_DEATH.

source: If death tests are supported, behaves the same as [`EXPECT_DEATH`](#EXPECT_DEATH).
it_it: Se i death test sono supportati, si comporta allo stesso modo di [`EXPECT_DEATH`](#EXPECT_DEATH).

source: If enough projects want to use the same interface, they can always share it, just like they have been sharing Concrete.
it_it: Se un numero sufficiente di progetti vuole utilizzare la stessa interfaccia, può sempre condividerla, proprio come hanno condiviso Concrete.

source: If enough projects want to use the same interface, they can always share it, just like they have been sharing `Concrete`.
it_it: Se un numero sufficiente di progetti vuole utilizzare la stessa interfaccia, può sempre condividerla, proprio come hanno condiviso `Concrete`.

source: If it fits your needs, then just link your test with the gtest_main library and you are good to go.
it_it: Se soddisfa le esigenze, basta linkare il test alla libreria gtest_main e si è a posto.

source: If it fits your needs, then just link your test with the `gtest_main` library and you are good to go.
it_it: Se soddisfa le esigenze, basta linkare il test alla libreria `gtest_main` e si è a posto.

source: If it leaves the current function via a `return` statement or by throwing an exception, the death test is considered to have failed.
it_it: Se lascia la funzione corrente tramite un'istruzione `return` o per un'eccezione, il death test viene considerato fallito.

source: If it's a raw pointer, you are responsible for managing the lifespan of the pointed values.
it_it: Se si tratta di un puntatore semplice [raw], si è responsabili della gestione della durata dei valori puntati.

source: If it's called outside of all test suites (e.g. in a test environment), it will be attributed to the top-level XML element.
it_it: Se viene chiamato al di fuori di tutte le test suite (ad esempio in un ambiente di test), verrà attribuito all'elemento XML di livello superiore.

source: If it's called outside of a test but between a test suite's SetUpTestSuite() and TearDownTestSuite() methods, it will be attributed to the XML element for the test suite.
it_it: Se viene chiamato al di fuori di un test ma tra i metodi SetUpTestSuite() e TearDownTestSuite() della test suite, verrà attribuito all'elemento XML per la test suite.

source: If it's called outside of a test but between a test suite's `SetUpTestSuite()` and `TearDownTestSuite()` methods, it will be attributed to the XML element for the test suite.
it_it: Se viene chiamato al di fuori di un test ma tra i metodi `SetUpTestSuite()` e `TearDownTestSuite()` della test suite, verrà attribuito all'elemento XML per la test suite.

source: If necessary, write a default constructor or SetUp() function to prepare the objects for each test.
it_it: Se necessario, si scrive un costruttore di default o una funzione SetUp() per preparare gli oggetti per ciascun test.

source: If necessary, write a default constructor or `SetUp()` function to prepare the objects for each test.
it_it: Se necessario, si scrive un costruttore di default o una funzione `SetUp()` per preparare gli oggetti per ciascun test.

source: If necessary, write a destructor or TearDown() function to release any resources you allocated in SetUp() .
it_it: Se necessario, scrivere un distruttore o una funzione TearDown() per rilasciare eventuali risorse allocate in SetUp() .

source: If necessary, write a destructor or `TearDown()` function to release any resources you allocated in `SetUp()` .
it_it: Se necessario, scrivere un distruttore o una funzione `TearDown()` per rilasciare eventuali risorse allocate in `SetUp()`.

source: If necessary, you can continue to derive test fixtures from a derived fixture.
it_it: Se necessario, è possibile continuare a derivare fixture da una fixture derivata.

source: If needed, define subroutines for your tests to share.
it_it: Se necessario, definire delle subroutine da condividere tra i test.

source: If neither WillOnce nor WillRepeatedly are specified, the inferred cardinality is Times(1).
it_it: Se non vengono specificati né WillOnce né WillRepeatedly, la cardinalità dedotta è Times(1).

source: If neither [`WillOnce`](#EXPECT_CALL.WillOnce) nor [`WillRepeatedly`](#EXPECT_CALL.WillRepeatedly) are specified, the inferred cardinality is `Times(1)`.
it_it: Se non vengono specificati né [`WillOnce`](#EXPECT_CALL.WillOnce) né [`WillRepeatedly`](#EXPECT_CALL.WillRepeatedly), la cardinalità dedotta è `Times(1)`.

source: If not, it will take you about 10 minutes to learn the basics and get started.
it_it: In caso contrario, ci vorranno circa 10 minuti per apprendere le nozioni di base e cominciare.

source: If so, you can instead define a PrintTo() function like this:
it_it: Se è così, si può definire una funzione PrintTo() come questa:

source: If so, you can instead define a `PrintTo()` function like this:
it_it: Se è così, si può definire una funzione `PrintTo()` come questa:

source: If so, you need to tell pkg-config where it can find the .pc files containing the information.
it_it: Se è così, si deve dire a pkg-config dove può trovare i file .pc contenenti le informazioni.

source: If so, you need to tell pkg-config where it can find the `.pc` files containing the information.
it_it: Se è così, si deve dire a pkg-config dove può trovare i file `.pc` contenenti le informazioni.

source: If some calls to the method are allowed, but the rest are not, just list all the expected calls:
it_it: Se alcune chiamate al metodo sono consentite, ma le altre no, elencare semplicemente tutte le chiamate previste:

source: If some or all expectations must be matched in a given order, you can use the After clause or InSequence clause of EXPECT_CALL, or use an InSequence object.
it_it: Se alcune o tutte le expectation devono essere soddisfatte in un determinato ordine, si può utilizzare la clausola After o la clausola InSequence di EXPECT_CALL, oppure usare un oggetto InSequence.

source: If some or all expectations must be matched in a given order, you can use the [`After` clause](reference/mocking.md#EXPECT_CALL.After) or [`InSequence` clause](reference/mocking.md#EXPECT_CALL.InSequence) of `EXPECT_CALL`, or use an [`InSequence` object](reference/mocking.md#InSequence).
it_it: Se alcune o tutte le expectation devono essere soddisfatte in un determinato ordine, si può utilizzare la [clausola `After`](reference/mocking.md#EXPECT_CALL.After) o la [clausola `InSequence`](reference/mocking.md#EXPECT_CALL.InSequence) di `EXPECT_CALL`, oppure usare un [oggetto `InSequence`](reference/mocking.md#InSequence).

source: If the function parameter is passed by pointer or reference, declaring the pointee or referee as const is still meaningful.
it_it: Se il parametro della funzione viene passato tramite puntatore o riferimento, dichiarare il puntato o il riferito come const ha ancora senso.

source: If the Times clause is omitted, GoogleTest infers the cardinality as follows:
it_it: Se la clausola Times viene omessa, GoogleTest deduce la cardinalità come segue:

source: If the built-in set of cardinalities doesn't suit you, you are free to define your own by implementing the following interface (in namespace testing):
it_it: Se l'insieme nativo delle cardinalità non è sufficiente, se ne può definire uno implementando la seguente interfaccia (nel namespace testing):

source: If the painter object didn't call this method, your test will fail with a message like this:
it_it: Se l'oggetto painter non ha chiamato questo metodo, il test fallirà con un messaggio come questo:

source: If the [built-in set](gmock_cheat_sheet.md#CardinalityList) of cardinalities doesn't suit you, you are free to define your own by implementing the following interface (in namespace `testing`):
it_it: Se l'[insieme nativo](gmock_cheat_sheet.md#CardinalityList) delle cardinalità non è sufficiente, se ne può definire uno implementando la seguente interfaccia (nel namespace `testing`):

source: If the `Times` clause is omitted, GoogleTest infers the cardinality as follows:
it_it: Se la clausola `Times` viene omessa, GoogleTest deduce la cardinalità come segue:

source: If the `painter` object didn't call this method, your test will fail with a message like this:
it_it: Se l'oggetto `painter` non ha chiamato questo metodo, il test fallirà con un messaggio come questo:

source: If the above assertions fail, they will print something like:
it_it: Se le affermazioni di cui sopra falliscono, stamperanno qualcosa come:

source: If the action doesn't have an internal state (i.e. if it always does the same thing no matter how many times it has been called), you can assign it to an action variable and use that variable repeatedly.
it_it: Se l'azione non ha uno stato interno (cioè se fa sempre la stessa cosa indipendentemente da quante volte è stata chiamata), si può assegnarla a una variabile di azione e utilizzare quella variabile ripetutamente.

source: If the assertion checks the wrong condition, then the program may proceed in an erroneous state, which could lead to memory corruption, security holes, or worse.
it_it: Se l'asserzione verifica la condizione sbagliata, il programma potrebbe procedere in uno stato errato, che potrebbe portare al danneggiamento della memoria, a buchi di sicurezza o peggio.

source: If the behavior change is more complex, you can store the effects in a variable and make a mock method get its return value from that variable:
it_it: Se la modifica del comportamento è più complessa, se ne possono memorizzare gli effetti in una variabile e fare in modo che un metodo mock ottenga il valore restituito da quella variabile:

source: If the built-in actions don't suit you, you can use an existing callable (function, std::function, method, functor, lambda) as an action.
it_it: Se le azioni native non soddisfano, si può utilizzare un chiamabile [callable] esistente (funzione, std::function, metodo, funtore, lambda) come azione.

source: If the built-in actions don't suit you, you can use an existing callable (function, `std::function`, method, functor, lambda) as an action.
it_it: Se le azioni native non soddisfano, si può utilizzare un chiamabile [callable] esistente (funzione, `std::function`, metodo, funtore, lambda) come azione.

source: If the built-in actions don't work for you, you can easily define your own one.
it_it: Se le azioni [action] native non funzionano, se ne può facilmente definirne una propria.

source: If the class is defined in a namespace, then in order to be friends of the class, test fixtures and tests must be defined in the exact same namespace, without inline or anonymous namespaces.
it_it: Se la classe è definita in un namespace, allora per essere 'friend' della classe, le fixture e i test devono essere definiti esattamente nello stesso namespace, non inline né namespace anonimi.

source: If the compiler complains that value doesn't have a public copy constructor, try wrap it in std::ref(), e.g. Eq(std::ref(non_copyable_value)).
it_it: Se il compilatore lamenta che value non ha un costruttore di copia pubblica, provare a racchiuderlo in std::ref(), ad es. Eq(std::ref(non_copyable_value)).

source: If the compiler complains that `value` doesn't have a public copy constructor, try wrap it in `std::ref()`, e.g. `Eq(std::ref(non_copyable_value))`.
it_it: Se il compilatore lamenta che `value` non ha un costruttore di copia pubblica, provare a racchiuderlo in `std::ref()`, ad es. `Eq(std::ref(non_copyable_value))`.

source: If the container is passed by pointer instead of by reference, just write Pointee(ElementsAre*(...)).
it_it: Se il container viene passato tramite puntatore anziché per riferimento, si scrive semplicemente Pointee(ElementsAre*(...)).

source: If the container is passed by pointer instead of by reference, just write `Pointee(ElementsAre*(...))`.
it_it: Se il container viene passato tramite puntatore anziché per riferimento, si scrive semplicemente `Pointee(ElementsAre*(...))`.

source: If the death test statement runs to completion without dying, the child process will nonetheless terminate, and the assertion fails.
it_it: Se l'istruzione del death test viene completata senza 'morire, il processo figlio terminerà comunque e l'asserzione fallirà.

source: If the declaration of the static data member is constexpr then it is implicitly an inline definition, and a separate definition in foo.cc is not needed:
it_it: Se la dichiarazione del membro dati statico è constexpr allora è implicitamente una definizione inline e non è necessaria una definizione separata in foo.cc:

source: If the declaration of the static data member is `constexpr` then it is implicitly an `inline` definition, and a separate definition in `foo.cc` is not needed:
it_it: Se la dichiarazione del membro dati statico è `constexpr` allora è implicitamente una definizione `inline` e non è necessaria una definizione separata in `foo.cc`:

source: If the file already exists (perhaps left over from a previous run), GoogleTest will pick a different name (e.g. foo_test_1.xml) to avoid overwriting it.
it_it: Se il file esiste già (magari rimasto da un'esecuzione precedente), GoogleTest sceglierà un nome diverso (ad esempio foo_test_1.xml) per evitare di sovrascriverlo.

source: If the file already exists (perhaps left over from a previous run), GoogleTest will pick a different name (e.g. `foo_test_1.xml`) to avoid overwriting it.
it_it: Se il file esiste già (magari rimasto da un'esecuzione precedente), GoogleTest sceglierà un nome diverso (ad esempio `foo_test_1.xml`) per evitare di sovrascriverlo.

source: If the function parameter is passed by pointer or reference, declaring the pointee or referee as `const` is still meaningful.
it_it: Se il parametro della funzione viene passato tramite puntatore o riferimento, dichiarare il puntato o il riferito come `const` ha ancora senso.

source: If the matching expectation cannot take any more calls, you will get an upper-bound-violated failure.
it_it: Se la corrispondente expectation non può accettare più chiamate, si verificherà un errore con violazione del limite superiore [upper-bound-violated].

source: If the mock function's return type is a reference, you can do it using ReturnRef(x), as shown in the previous recipe ("Returning References from Mock Methods").
it_it: Se il tipo restituito dalla funzione mock è un riferimento, lo si può fare utilizzando ReturnRef(x), come mostrato nella ricetta precedente ("Restituire Riferimenti dai Metodi Mock").

source: If the mock function's return type is a reference, you can do it using `ReturnRef(x)`, as shown in the previous recipe ("Returning References from Mock Methods").
it_it: Se il tipo restituito dalla funzione mock è un riferimento, lo si può fare utilizzando `ReturnRef(x)`, come mostrato nella ricetta precedente ("Restituire Riferimenti dai Metodi Mock").

source: If the mock method also needs to return a value as well, you can chain SetArgPointee() with Return() using DoAll(), remembering to put the Return() statement last:
it_it: Se anche il metodo mock deve restituire un valore, si può concatenare SetArgPointee() con Return() usando DoAll(), ricordando di mettere l'istruzione Return() in ultimo:

source: If the mock method also needs to return a value as well, you can chain `SetArgPointee()` with `Return()` using `DoAll()`, remembering to put the `Return()` statement last:
it_it: Se anche il metodo mock deve restituire un valore, si può concatenare `SetArgPointee()` con `Return()` usando `DoAll()`, ricordando di mettere l'istruzione `Return()` in ultimo:

source: If the output argument is an array, use the SetArrayArgument<N>(first, last) action instead.
it_it: Se l'argomento di output è un array, si usa invece l'azione SetArrayArgument<N>(first, last).

source: If the output argument is an array, use the `SetArrayArgument<N>(first, last)` action instead.
it_it: Se l'argomento di output è un array, si usa invece l'azione `SetArrayArgument<N>(first, last)`.

source: If the second warning contains this message too, #2 will match again and result in an upper-bound-violated error.
it_it: Se anche il secondo warning contiene questo messaggio, #2 corrisponderà [match] nuovamente e genererà un errore di violazione del limite superiore [upper-bound-violated].

source: If the tear-down operation could throw an exception, you must use TearDown() as opposed to the destructor, as throwing in a destructor leads to undefined behavior and usually will kill your program right away.
it_it: Se l'operazione di ripulitura (tear-down) può generare un'eccezione, si deve usare TearDown() invece del distruttore, poiché l'inserimento di un distruttore porta a un comportamento indefinito e solitamente "killerà" immediatamente il programma.

source: If the tear-down operation could throw an exception, you must use `TearDown()` as opposed to the destructor, as throwing in a destructor leads to undefined behavior and usually will kill your program right away.
it_it: Se l'operazione di ripulitura (tear-down) può generare un'eccezione, si deve usare `TearDown()` invece del distruttore, poiché l'inserimento di un distruttore porta a un comportamento indefinito e solitamente "killerà" immediatamente il programma.
